Wavetrend/RX14XX-TestApp/main.c
/**
  Generated main.c file from MPLAB Code Configurator

  @Company
    Microchip Technology Inc.

  @File Name
    main.c

  @Summary
    This is the generated main.c using PIC24 / dsPIC33 / PIC32MM MCUs.

  @Description
    This source file provides main entry point for system initialization and application code development.
    Generation Information :
        Product Revision  :  PIC24 / dsPIC33 / PIC32MM MCUs - 1.145.0
        Device            :  PIC24FJ256GB206
    The generated drivers are tested against the following:
        Compiler          :  XC16 v1.36b
        MPLAB 	          :  MPLAB X v5.25
*/

/*
    (c) 2019 Microchip Technology Inc. and its subsidiaries. You may use this
    software and any derivatives exclusively with Microchip products.

    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED
    WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
    PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION
    WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.

    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE,
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS
    BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE
    FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN
    ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
    THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.

    MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE
    TERMS.
*/

/**
  Section: Included Files
*/
#include <stdio.h>
#include <stdbool.h>

#include <xc.h>
#include "mcc_generated_files/system.h"

#include "utlist.h"

#include "wtapi_circular_buffer.h"
#include "wt_assert.h"
#include "wt_error.h"

#include "wthal_timer_pic24.h"
#include "wthal_counter.h"

/*
                         Main application
 */

WTAPI_DECLARE_CIRCULAR_BUFFER(uint8_t, wt_rx14xx_uint8_buffer);
WTAPI_DEFINE_CIRCULAR_BUFFER(uint8_t, wt_rx14xx_uint8_buffer);

//////////////////////////////// OBSERVER /////////////////////////////////////

typedef struct wthal_observer_tag wthal_observer_t;
typedef void (*wthal_observer_callback_t)(void * const context, wt_error_t * const error);

struct wthal_observer_tag {
    wthal_observer_callback_t callback;
    void * context;
    wt_error_t * error;
    wthal_observer_t * volatile next;
    wthal_observer_t * volatile prev;
};

typedef struct {
    wthal_observer_t * volatile head;
} wthal_observers_t;

void wthal_observers_dispatch(wthal_observers_t * const instance) {
    wthal_observer_t * el, * tmp;
    DL_FOREACH_SAFE(instance->head, el, tmp) {
        el->callback(el->context, el->error);
    }
}

wthal_observer_t * wthal_observers_head(wthal_observers_t * const instance) {
    return instance->head;
}

bool wthal_observers_add(wthal_observers_t * const instance, wthal_observer_t * const elem) {
    DL_APPEND(instance->head, elem);
    return true;
}

bool wthal_observers_delete(wthal_observers_t * const instance, wthal_observer_t * const elem) {
    DL_DELETE(instance->head, elem);
    return true;
}

typedef struct {
    
    bool (*enable)(void * const context, bool const enable, wt_error_t * const error);
    bool (*set_flag)(void * const context, bool const set, wt_error_t * const error);
    bool (*get_flag)(void * const context, wt_error_t * const error);
    bool (*set_priority)(void * const context, uint8_t const priority, wt_error_t * const error);
    uint8_t (*get_priority)(void * const context, wt_error_t * const error);
    bool (*add_observer)(void * const context, wthal_observer_callback_t callback, void * const callback_context, wt_error_t * const error);
    
} wthal_isr_impl_t;

typedef struct {
    
    wthal_isr_impl_t * impl;
    void * context;
    
} wthal_isr_t;

typedef enum {
    wthal_isr_priority_1 = 1,
    wthal_isr_priority_2 = 2,
    wthal_isr_priority_3 = 3,
    wthal_isr_priority_4 = 4,
    wthal_isr_priority_5 = 5,
    wthal_isr_priority_6 = 6,
    wthal_isr_priority_7 = 7,
} wthal_isr_priority_t;

wthal_isr_t * const wthal_isr_init(wthal_isr_t * const instance, wthal_isr_impl_t * const impl, void * const context, wt_error_t * const error) {
    bool ok = true;
    ok = !ok ? ok : wt_assert_ptr(instance, error);
    if (ok) {
        instance->impl = impl;
        instance->context = context;
    }
    return ok ? instance : NULL;
}

bool wthal_isr_enable(wthal_isr_t * const instance, bool const enable, wt_error_t * const error) {
    return instance->impl->enable(instance->context, enable, error);
}

bool wthal_isr_set_flag(wthal_isr_t * const instance, bool const set, wt_error_t * const error) {
    return instance->impl->set_flag(instance->context, set, error);
}

bool wthal_isr_get_flag(wthal_isr_t * const instance, wt_error_t * const error) {
    return instance->impl->get_flag(instance->context, error);
}

bool wthal_isr_set_priority(wthal_isr_t * const instance, uint8_t const priority, wt_error_t * const error) {
    return instance->impl->set_priority(instance->context, priority, error);
}

bool wthal_isr_get_priority(wthal_isr_t * const instance, wt_error_t * const error) {
    return instance->impl->get_priority(instance->context, error);
}

bool wthal_isr_add_observer(wthal_isr_t * const instance, wthal_observer_callback_t callback, void * const context, wt_error_t * const error) {
    return instance->impl->add_observer(instance->context, callback, context, error);
}

#define WTHAL_ISR_DECLARE(NAME) \
    typedef struct { \
        wthal_isr_t isr; \
    } NAME ## _t; \
    wthal_isr_t * const NAME ## _init(NAME ## _t * const instance, wthal_isr_priority_t const interrupt_priority, wthal_observer_t * const observers, size_t const size, wt_error_t * const error);

#define WTHAL_ISR_DEFINE(NAME, ISR, IF, IE, IP) \
    static wthal_observers_t NAME ## _active = {}; \
    static wthal_observers_t NAME ## _inactive = {}; \
    void __attribute__ (( interrupt, no_auto_psv )) ISR ( void ) { \
        wthal_observers_dispatch(&NAME ## _active); \
        IF = 0; \
    } \
    static bool NAME ## _enable_impl(void * const context, bool const enable, wt_error_t * const error) { \
        IE = enable; \
        return true; \
    } \
    static bool NAME ## _set_flag_impl(void * const context, bool const set, wt_error_t * const error) { \
        IF = set; \
        return true; \
    } \
    static bool NAME ## _get_flag_impl(void * const context, wt_error_t * const error) { \
        return IF; \
    } \
    static bool NAME ## _set_priority_impl(void * const context, uint8_t const priority, wt_error_t * const error) { \
        IP = priority; \
        return true; \
    } \
    static uint8_t NAME ## _get_priority_impl(void * const context, wt_error_t * const error) { \
        return IP; \
    } \
    static bool NAME ## _add_observer_impl(void * const context, wthal_observer_callback_t callback, void * const callback_context, wt_error_t * const error) { \
        wthal_observer_t * elem = wthal_observers_head(&NAME ## _inactive); \
        bool ok = true; \
        ok = !ok ? ok : wt_assert(elem != NULL, WT_ERROR_ENOSPC, error); \
        if (ok) { \
            wthal_observers_delete(&NAME ## _inactive, elem); \
            elem->callback = callback; \
            elem->context = callback_context; \
            elem->error = error; \
            wthal_observers_add(&NAME ## _active, elem); \
        } \
        return ok; \
    } \
    static wthal_isr_impl_t NAME ## _impl = { \
        .enable = NAME ## _enable_impl, \
        .add_observer = NAME ## _add_observer_impl, \
        .set_flag = NAME ## _set_flag_impl, \
        .get_flag = NAME ## _get_flag_impl, \
        .set_priority = NAME ## _set_priority_impl, \
        .get_priority = NAME ## _get_priority_impl, \
    }; \
    wthal_isr_t * const NAME ## _init(NAME ## _t * const instance, wthal_isr_priority_t const interrupt_priority, wthal_observer_t * const observers, size_t const size, wt_error_t * const error) { \
        IE = 0; \
        IF = 0; \
        IP = interrupt_priority; \
        for (size_t i=0 ; i < size ; i++) { \
            wthal_observers_add(&NAME ## _inactive, &observers[i]); \
        } \
        return wthal_isr_init(&instance->isr, &NAME ## _impl, instance, error); \
    }

///////////////////////////////// GPIO ///////////////////////////////////////

